cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'openssl'
brew 'node'
brew 'ruby-build'
brew 'rbenv'
brew 'wget'
brew 'git'
brew 'icu4c'
brew 'python'
brew 'htop'
brew 'mysql'

cask '1password'
cask 'alfred'
cask 'spectacle'
cask 'dropbox'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'sourcetree'
cask 'vlc'
cask 'kodi'
cask 'istat-menus'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'dockertoolbox'
cask 'vagrant'
cask 'karabiner'
cask 'java'

cask 'intellij-idea'
cask 'rubymine'
cask 'pycharm'
