cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/cask-drivers'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'openssl'
brew 'jenv'
brew 'nvm'
brew 'wget'
brew 'git'
brew 'icu4c'
brew 'python'
brew 'python3'
brew 'htop'
brew 'tig'
brew 'fasd'
brew 'jq'
brew 'tmux'
brew 'tree'
brew 'terraform'
brew 'fzf'
brew 'lnav'
brew 'yarn'
brew 'awscli'
brew 'pt'

cask '1password'
cask 'alfred'
cask 'dropbox'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'sourcetree'
cask 'istat-menus'
cask 'docker'
cask 'karabiner-elements'
cask 'java'
cask 'java8'
cask 'mysqlworkbench'
cask 'visual-studio-code'
cask 'clipy'
cask 'jetbrains-toolbox'
cask 'numi'
cask 'font-fira-code'
cask 'notion'
cask 'logitech-options'
cask 'bartendar'
cask 'gitkraken'
cask 'wireshark'

mas "kakaotalk", id: 869223134
mas "Magnet", id: 441258766
mas "Ampetamine", id: 937984704
